artillery/index.yaml
config:
  target: 'https://ansel.4lch4.cloud/api/v1'
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up

    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load

    - duration: 600
      arrivalRate: 50
      name: Sustained load

  payload:
    path: 'folders.csv'
    fields:
      - 'folderName'

  environments:
    production:
      target: 'https://ansel.4lch4.cloud/api/v1'
    testing:
      target: 'https://ansel-test.4lch4.cloud/api/v1'

scenarios:
  - name: 'Get Images'
    flow:
      # - log: 'Get {{ folderName }}'
      - get:
          url: '/get/{{ folderName }}'
      - get:
          url: '/list'